pub const MAT_ROOTS: &[&str] = &[
    "хуй",
    "хуе",
    "хуё",
    "хуя",
    "хуи",
    "хую",
    "пизд",
    "ёб",
    "еб",
    "бля",
    "муд",
    "гандон",
    "сук",
    "пидор",
    "дроч",
    "залуп",
    "говн",
    "срак",
    "хер",
];

pub const MAT_EXCEPTIONS: &[&str] = &[
    "себе",
    "тебе",
    "хлеб",
    "небе",
    "погреб",
    "гребу",
    "мудр",
    "мудре",
    "бляха",
    "херсон",
    "сукно",
    "страх",
];

pub const PREFIXES: &[&str] = &[
    "недо", "пере", "при", "раз", "под", "вы", "за", "по", "на", "от", "до", "из", "об", "у", "в",
    "с",
];
