use rand::seq::IndexedRandom;
use teloxide::{
    Bot,
    payloads::SetMessageReactionSetters,
    prelude::Requester,
    sugar::request::RequestReplyExt,
    types::{Me, ReactionType, Update, UpdateKind::Message},
};

use crate::ops::error::Error;

fn random_quote() -> String {
    let pool = vec![
        "Ты сдохнешь в аду урод",
        "Я бы тебе просто по твоей лысине вонючей c пыру въебал",
        "Да да нет нет, подумать до завтра есть время у тебя",
        "Мы на сво пойдем родину защищать ?",
        "слава богу мы живем в россии, а не в америке",
        "Да, ракурс делает вещи, в жизни ты бы увидел, писе не поднялась бы",
        "Девушка бориса",
        "ты 1х1 не хочешь пойти попиздиться? чисто за честь владимира путина",
        "Я за люля кебаб на пятьсот Рублевой купюре",
        "Я бы вмешался, но мне впн дороже",
        "Адекватный человек такое читать не будет",
        "Ну я понял гуляш говно потому что напоминает ссср",
        "Я брал последнее время пикник и там было 2 разновидности, один обычный, другой какой-то нестандартный, я всегда брал дефолт, решил попробовать экзотику, я взял, попробовал и пхуел, я такого говна не пробовал никогда, это видимо от какого-то местного производителя",
        "Это 90 айкью юмор я Даун",
        "Да, давай с тобой подеремся, если я побеждаю, я тебя из квартиры выписываю, а если ты, я просто заплачу и домой пойду",
        "Манифест куколдистической партии. Принципы куколдизма",
        "РАБотают рабы, я созерцал",
        "и че ? тебя нахуярить чтоли ты имеешь ввиду ?",
        "Да он уже в опущенке, там его разбирать даже смысла нет, его смотрят уже только конченные фрико зомби",
        "Степан как обычно очень сильно всех зауважал и убежал домой",
    ];
    let mut rng = rand::rng();
    match pool.choose(&mut rng) {
        Some(quote) => quote.to_string(),
        None => panic!("Can't find quote"),
    }
}

pub async fn process_stream_msg(bot: Bot, update: Update, _: Me) -> Result<(), Error> {
    match update.kind {
        Message(msg) => match msg.text() {
            Some(_) => {
                let quote = random_quote();
                let _ = bot.send_message(msg.chat.id, quote).reply_to(msg.id).await;
                let _ = bot
                    .set_message_reaction(msg.chat.id, msg.id)
                    .reaction(vec![ReactionType::Emoji {
                        emoji: "🤡".to_string(),
                    }])
                    .await;
                Ok(())
            }
            None => Ok(()),
        },
        _ => Ok(()),
    }
}
